-- +goose Up
CREATE TABLE IF NOT EXISTS goods (
    product_id SERIAL PRIMARY KEY,
    category VARCHAR(50) NOT NULL,
    sex VARCHAR(50) NOT NULL CHECK (sex IN ('male', 'female', 'unisex')),
    sizes INTEGER[] NOT NULL,
    price NUMERIC NOT NULL,
    color VARCHAR(50) NOT NULL,
    tag VARCHAR(50) NOT NULL
);
INSERT INTO goods (category, sex, sizes, price, color, tag)
VALUES 
  ('кроксы', 'unisex', '{36,37,38,39,40,41,42,43,45,46}', 3300, 'черный', 'со скидкой'),
  ('джибитсы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 2000, 'разные цвета', 'бестселлер'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 3300, 'желтый', 'в наличии, со скидкой'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 4400, 'красный', 'в наличии, бестселлер'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 4500, 'зеленый, черный', 'в наличии, новинка'),
  ('кроксы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 5500, 'белый', 'бестселлер, в наличии'),
  ('джибитсы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 3300, 'разные цвета', 'новинка, скидка'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 4400, 'бежевый', 'новинка, со скидкой, в наличии'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 2500, 'розовый, красный', 'бестселлер, в наличии'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 2200, 'коричневый', 'в наличии'),
  ('кроксы', 'female', '{36,37,38,39,40,41,42,43}', 3300, 'розовый, черный', 'в наличии'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 5500, 'коричневый', 'бестселлер, в наличии'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 2200, 'красный', 'бестселлер, в наличии, новинка'),
  ('кроксы', 'female', '{36,37,38,39,40,41,42,43}', 3300, 'розовый', 'новинка, в наличии'),
  ('кроксы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 3300, 'голубой', 'новинка, в наличии'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 2500, 'коричневый, бежевый', 'бестселлер, в наличии, новинка'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 2200, 'красный', 'бестселлер, в наличии'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 3300, 'зеленый', 'бестселлер, в наличии'),
  ('джибитсы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 2000, 'желтый', 'бестселлер, в наличии'),
  ('шлепки', 'male', '{39,40,41,42,43,44,45,46}', 3000, 'бежевый', 'бестселлер'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 3300, 'бежевый', 'в наличии, новинка'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 5500, 'коричневый', 'в наличии'),
  ('шлепки', 'female', '{36,37,38,39,40,41,42,43}', 6600, 'коричневый', 'в наличии, бестселлер, новинка'),
  ('кроксы', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 7700, 'синий', 'в наличии, бестселлер'),
  ('шлепки', 'unisex', '{36,37,38,39,40,41,42,43,44,45,46}', 8000, 'синий, черный', 'в наличии, бестселлер');


CREATE TABLE IF NOT EXISTS goose_db_version (
    id SERIAL PRIMARY KEY,
    version_id BIGINT NOT NULL,
    is_applied BOOLEAN NOT NULL,
    tstamp TIMESTAMP DEFAULT NOW()
);
-- +goose Down
DROP TABLE goods;